app/controllers/events_controller.rb

SELECT `events`.* FROM `events`
---
  def index
    @events = Event.all

INSERT INTO `events` (`name`, `description`, `created_at`, `updated_at`) VALUES ('snacks ', 'with friends', '2016-09-25 13:26:41', '2016-09-25 13:26:41')
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
---
    def set_event
      @event = Event.find(params[:id])