app/controllers/expenses_controller.rb

  def create
    status = Expense.create_expense(expense_params)
---
INSERT INTO `expenses` (`location`, `event_id`, `total_amount`, `exp_date`, `created_at`, `updated_at`) VALUES ('pune', 1, 1000.0, '2016-09-05', '2016-09-25 15:19:12', '2016-09-25 15:19:12')