app/controllers/reports_controller.rb

  def set_params
    if params[:from_date].present? && params[:to_date].present?
      params[:from_date]
      params[:to_date]
    else
      params[:from_date] = Expense.last.try(:exp_date).to_date
      params[:to_date] = Expense.first.try(:exp_date).to_date
---
SELECT  `expenses`.* FROM `expenses`  ORDER BY `expenses`.`id` DESC LIMIT 1
SELECT  `expenses`.* FROM `expenses`  ORDER BY `expenses`.`id` ASC LIMIT 1